## Input-Output practice in the console

>РЎРѕР·РґР°РЅРѕ РґР»СЏ Р±СѓРґСѓС‰РёС… СЃС‚СѓРґРµРЅС‚РѕРІ РЅР°РїСЂР°РІР»РµРЅРёСЏ `РРЅС„РѕСЂРјР°С‚РёРєР° Рё РІС‹С‡РёСЃР»РёС‚РµР»СЊРЅР°СЏ С‚РµС…РЅРёРєР°`. </br>
<b>РќРµ Р·Р»РѕСѓРїРѕС‚СЂРµР±Р»СЏР№С‚Рµ СЌС‚РѕР№ Р±Р°Р·РѕР№, РїРѕР¶Р°Р»СѓР№СЃС‚Р°.</b> РћРЅР° СЃРѕР·РґР°РЅР° РґР»СЏ С‚РѕРіРѕ, С‡С‚РѕР±С‹ РІС‹ Р±С‹СЃС‚СЂРѕ Рё РѕРїРµСЂР°С‚РёРІРЅРѕ РјРѕРіР»Рё РїРѕСЃРјРѕС‚СЂРµС‚СЊ РїСЂР°РІРёР»СЊРЅРѕРµ СЂРµС€РµРЅРёРµ. </br>
`Р’Р°С€Р° РіР»Р°РІРЅР°СЏ Р·Р°РґР°С‡Р° - РѕР±СѓС‡РµРЅРёРµ`, РЅРѕ РІС‹ РЅРµ СЃРјРѕР¶РµС‚Рµ РЅР°СѓС‡РёС‚СЊСЃСЏ, РµСЃР»Рё РїСЂРѕСЃС‚Рѕ СЃРєРѕРїРёСЂСѓРµС‚Рµ РІРµСЂРЅС‹Р№ РєРѕРґ Р±РµР· РµРіРѕ Р°РЅР°Р»РёР·Р°. </br>
РЈСЃРїРµС…РѕРІ РІ РІР°С€РёС… РЅР°С‡РёРЅР°РЅРёСЏС…!

---

### `Question 1`
>РќР°РїРёС€РёС‚Рµ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ С†РµР»РѕРµ С‡РёСЃР»Рѕ СЃРѕ Р·РЅР°РєРѕРј Рё РІС‹РІРѕРґСЏС‰РµРµ РµРіРѕ РІ С„РѕСЂРјР°С‚Рµ В±00000 (РјРёРЅРёРјСѓРј РїСЏС‚СЊ СЃРёРјРІРѕР»РѕРІ). РќР°РїСЂРёРјРµСЂ, РїСЂРё РІРІРѕРґРµ 5 РІС‹РІРѕРґРёС‚СЊСЃСЏ РґРѕР»Р¶РЅРѕ 00005. РџСЂРё РІРІРѕРґРµ -789 РІС‹РІРѕРґРёС‚СЃСЏ -00789.
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int a;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);

    scanf("%i", &a);
    if (a>=0) printf("%05d", a);
    else printf("%06d",a);
    return EXIT_SUCCESS;
}
```
### `Question 2`
>РќР°РїРёС€РёС‚Рµ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ С†РµР»РѕРµ С‡РёСЃР»Рѕ Р±РµР· Р·РЅР°РєР° Рё РІС‹РІРѕРґСЏС‰РµРµ РµРіРѕ РІ С„РѕСЂРјР°С‚Рµ 000000 (РјРёРЅРёРјСѓРј 6 СЃРёРјРІРѕР»РѕРІ)
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int a;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);

    scanf("%i", &a);
    if (a>=0) printf("%06d", a);
    return EXIT_SUCCESS;
}
```
### `Question 3`
>РќР°РїРёС€РёС‚Рµ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ РІРµС‰РµСЃС‚РІРµРЅРЅРѕРµ С‡РёСЃР»Рѕ Рё РІС‹РІРѕРґСЏС‰РµРµ РµРіРѕ СЃ С‚РѕС‡РЅРѕСЃС‚СЊСЋ РґРѕ 3 Р·РЅР°РєР° РїРѕСЃР»Рµ Р·Р°РїСЏС‚РѕР№
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    float a;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);

    scanf("%f", &a);
    printf("%.3f", a);
    return EXIT_SUCCESS;
}
```
### `Question 4`
>РќР°РїРёС€РёС‚Рµ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ РѕРґРЅРѕ С†РµР»РѕРµ С‡РёСЃР»Рѕ, Р·Р°С‚РµРј РѕРґРЅРѕ РІРµС‰РµСЃС‚РІРµРЅРЅРѕРµ Рё РІС‹РІРѕРґСЏС‰РµРµ РёС… СЃСѓРјРјСѓ СЃ С‚РѕС‡РЅРѕСЃС‚СЊСЋ РґРѕ 5 Р·РЅР°РєР° РїРѕСЃР»Рµ Р·Р°РїСЏС‚РѕР№.
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    float a;
    int b;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);

    scanf("%i", &b);
    scanf("%f", &a);
    printf("%.5f", a+b);
    return EXIT_SUCCESS;
}
```
### `Question 5`
>РќР°РїРёС€РёС‚Рµ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ РґРІР° С‡РёСЃР»Р° Рё РІС‹РІРѕРґСЏС‰РµРµ РёС… РїСЂРѕРёР·РІРµРґРµРЅРёРµ СЃ С‚РѕС‡РЅРѕСЃС‚СЊСЋ РґРѕ 8 Р·РЅР°РєРѕРІ РїРѕСЃР»Рµ Р·Р°РїСЏС‚РѕР№.
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    float a,b;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);


    scanf("%f", &b);
    scanf("%f", &a);
    printf("%.8f", a*b);
    return EXIT_SUCCESS;
}
```
### `Question 6`
>РќР°РїРёС€РёС‚Рµ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ РІРµС‰РµСЃС‚РІРµРЅРЅРѕРµ С‡РёСЃР»Рѕ Рё РІС‹РІРѕРґСЏС‰РµРµ РµРіРѕ СЃ С‚РѕС‡РЅРѕСЃС‚СЊСЋ РґРѕ 10 Р·РЅР°РєР° РїРѕСЃР»Рµ Р·Р°РїСЏС‚РѕР№.
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    double a;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);

    scanf("%lf", &a);
    printf("%.10lf", a);
    return EXIT_SUCCESS;
}
```
### `Question 7`
>РќР°РїРёСЃР°С‚СЊ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃРёРјРІРѕР» СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ Рё РІС‹РІРѕРґСЏС‰РёР№ РµРіРѕ РѕР±СЂР°С‚РЅРѕ 2 СЂР°Р·Р°. РљР°Р¶РґС‹Р№ СЂР°Р· СЃРёРјРІРѕР» РІС‹РІРѕРґРёС‚СЃСЏ РЅР° РЅРѕРІРѕР№ СЃС‚СЂРѕРєРµ.
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    char c;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);

    scanf("%c", &c);
    printf("%c\n", c);
    printf("%c",c);
    return EXIT_SUCCESS;
}
```
### `Question 8`
>РќР°РїРёСЃР°С‚СЊ РїСЂРѕРіСЂР°РјРјСѓ, С‡РёС‚Р°СЋС‰СѓСЋ СЃРёРјРІРѕР» СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ Рё РІС‹РІРѕРґСЏС‰РёР№ РµРіРѕ РѕР±СЂР°С‚РЅРѕ 2 СЂР°Р·Р°. РљР°Р¶РґС‹Р№ СЂР°Р· СЃРёРјРІРѕР» РІС‹РІРѕРґРёС‚СЃСЏ РЅР° РЅРѕРІРѕР№ СЃС‚СЂРѕРєРµ. РџРѕСЃР»Рµ СЌС‚РѕРіРѕ РїСЂРѕРіСЂР°РјРјР° С‡РёС‚Р°РµС‚ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ РµС‰С‘ РѕРґРёРЅ СЃРёРјРІРѕР» Рё РІС‹РІРѕРґРёС‚ РѕР±Р° СЃРёРјРІРѕР»Р° РЅР° РѕРґРЅРѕР№ СЃС‚СЂРѕРєРµ С‡РµСЂРµР· СЃРёРјРІРѕР» РїРѕРґС‡С‘СЂРєРёРІР°РЅРёСЏ. Р’ СЂРµР·СѓР»СЊС‚Р°С‚Рµ СЂР°Р±РѕС‚С‹ РїСЂРѕРіСЂР°РјРјС‹ РґРѕР»Р¶РЅРѕ РїРѕР»СѓС‡РёС‚СЊСЃСЏ С‚СЂРё СЃС‚СЂРѕРєРё.
```
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    char c, buff;

    setvbuf(stdout, NULL, _IONBF, 0);
    setvbuf(stderr, NULL, _IONBF, 0);

    scanf("%c", &c);
    printf("%c\n", c);
    printf("%c\n",c);
    buff = c;
    scanf(" %c", &c);
    printf("%c_%c",buff,c);
    return EXIT_SUCCESS;
}
```
---
### Find me here:
* https://vk.com/grnbows </br>
* https://www.instagram.com/grnbows </br>
* https://twitter.com/grnbows </br>

### License

This project is free for personal and commercial use. </br> by grnbows


